app/views/lists/_accordion_list.html.erb

SELECT `tasks`.* FROM `tasks` WHERE `tasks`.`list_id` IN (4)
---

  <%if list.tasks.present?%>