app/views/tasks/_task_view.html.erb

        <div class="sub-text">
          <%= "Created on #{task.created_at.strftime('%Y-%m-%d')}"%>
---
INSERT INTO `tasks` (`text`, `created_at`, `updated_at`) VALUES ('ff', '2016-03-26 01:48:35.605596', '2016-03-26 01:48:35.605596')