app/controllers/lists_controller.rb

	def create
		@list = current_user.lists.create(list_params)

    @list.user_id = current_user.id
    @list.save
---
INSERT INTO `lists` (`name`, `privacy`, `user_id`, `created_at`, `updated_at`) VALUES ('alto em cima', 0, 2, '2016-03-26 05:56:53.957953', '2016-03-26 05:56:53.957953')
UPDATE `lists` SET `user_id` = 1, `updated_at` = '2016-03-19 18:53:35' WHERE `lists`.`id` = 2

	def index
		@lists = current_user.lists.includes(:tasks, :user).paginate(:page => params[:page], :per_page => 5)
---
SELECT  `lists`.* FROM `lists` WHERE `lists`.`user_id` = 2 LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM `lists` WHERE `lists`.`user_id` = 2
SELECT `tasks`.* FROM `tasks` WHERE `tasks`.`list_id` IN (1, 2, 3, 4)
SELECT `users`.* FROM `users` WHERE `users`.`id` IN (1)