app/controllers/lists_controller.rb

SELECT `lists`.* FROM `lists` WHERE `lists`.`privacy` = 1 AND (user_id <> 1)
---
	def publics
		@lists = List.where(:privacy => true)