app/controllers/tasks_controller.rb

INSERT INTO `tasks` (`text`, `created_at`, `updated_at`) VALUES ('ddd', '2016-03-22 04:29:16.078460', '2016-03-22 04:29:16.078460')
---
	def create
		@task = Task.new(task_params)
		@task.save!